In [1]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta
import time

# First we are going to answer the question due to Chicago city

**loading of Chicago data**

In [2]:
Chicago_data = pd.read_csv('chicago.csv')

**exploration of componants of data**

In [3]:
Chicago_data.columns

Index(['Unnamed: 0', 'Start Time', 'End Time', 'Trip Duration',
       'Start Station', 'End Station', 'User Type', 'Gender', 'Birth Year'],
      dtype='object')

In [4]:
Chicago_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     300000 non-null  int64
 1   Start Time     300000 non-null  object
 2   End Time       300000 non-null  object
 3   Trip Duration  300000 non-null  int64
 4   Start Station  300000 non-null  object
 5   End Station    300000 non-null  object
 6   User Type      300000 non-null  object
 7   Gender         238948 non-null  object
 8   Birth Year     238981 non-null  float64
dtypes: float64(1), int64(2), object(6)
memory usage: 20.6+ MB

In [5]:
Chicago_data.head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year
0,1423854,2017-06-23 15:09:32,2017-06-23 15:14:53,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0

**converting [Start Time,End Time] from object to datetime**

In [6]:
Chicago_data['Start Time'] = pd.to_datetime(Chicago_data['Start Time'], format='%Y-%m-%d %H:%M:%S')

In [9]:
Chicago_data['End Time'] = pd.to_datetime(Chicago_data['End Time'], format='%Y-%m-%d %H:%M:%S')

**Checking data info**

In [12]:
Chicago_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     300000 non-null  int64
 1   Start Time     300000 non-null  datetime64[ns]
 2   End Time       300000 non-null  datetime64[ns]
 3   Trip Duration  300000 non-null  int64
 4   Start Station  300000 non-null  object
 5   End Station    300000 non-null  object
 6   User Type      300000 non-null  object
 7   Gender         238948 non-null  object
 8   Birth Year     238981 non-null  float64
dtypes: datetime64[ns](2), float64(1), int64(2), object(4)
memory usage: 20.6+ MB

**spliting datetime**

In [14]:
Chicago_data["Start time o'clock"] = Chicago_data['Start Time'].dt.time

In [19]:
Chicago_data.head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year,Start time o'clock,End time o'clock
0,1423854,2017-06-23 15:09:32,2017-06-23 15:14:53,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0,15:09:32,15:14:53

In [17]:
Chicago_data["End time o'clock"] = Chicago_data['End Time'].dt.time

In [20]:
Chicago_data.head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year,Start time o'clock,End time o'clock
0,1423854,2017-06-23 15:09:32,2017-06-23 15:14:53,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0,15:09:32,15:14:53

**convering[Start time o'clock,End time o'clock] to datetime**

In [21]:
Chicago_data["Start time o'clock"] = pd.to_datetime(Chicago_data["Start time o'clock"], format='%H:%M:%S')

In [22]:
Chicago_data["End time o'clock"] = pd.to_datetime(Chicago_data["End time o'clock"], format='%H:%M:%S')

In [24]:
Chicago_data.head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year,Start time o'clock,End time o'clock
0,1423854,2017-06-23 15:09:32,2017-06-23 15:14:53,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0,1900-01-01 15:09:32,1900-01-01 15:14:53

**splitting datetime to 'Hour' column**

In [25]:
Chicago_data['Starting H'] = Chicago_data["Start time o'clock"].dt.strftime('%H')

In [26]:
Chicago_data['Ending H'] = Chicago_data["End time o'clock"].dt.strftime('%H')

In [31]:
Chicago_data.head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year,Start time o'clock,End time o'clock,Starting H,Ending H
0,1423854,2017-06-23 15:09:32,2017-06-23 15:14:53,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0,1900-01-01 15:09:32,1900-01-01 15:14:53,15,15

**Finding the most common Hour**

In [32]:
Chicago_data['Starting H'].value_counts().head(1)
#The most common Hour equel 17

17    35992
Name: Starting H, dtype: int64

**Splitting date to 'Month'**
**and finding the most common month**

In [33]:
Chicago_data['Start Time'].dt.month.value_counts().head(1)
#the most common  month in Start time is 6 'June'

6    98081
Name: Start Time, dtype: int64

In [34]:
Chicago_data['End Time'].dt.month.value_counts().head(1)
#the most common  month in End time is 6 'June'

6    98074
Name: End Time, dtype: int64

**Splitting date to 'Day'**
**and finding the most common Day**

In [35]:
Chicago_data['Start Time'].dt.day.value_counts().head(1)
#the most common  day in Start time is 18

18    12700
Name: Start Time, dtype: int64

In [36]:
Chicago_data['End Time'].dt.day.value_counts().head(1)
#the most common  day in Start End is 18

18    12690
Name: End Time, dtype: int64

**most common start station??**

In [38]:
Chicago_data['Start Station'].value_counts().head(1)
#'Streeter Dr & Grand Ave' is the most common start station

Streeter Dr & Grand Ave    6911
Name: Start Station, dtype: int64

**most common end station??**

In [39]:
Chicago_data['End Station'].value_counts().head(1)
#'Streeter Dr & Grand Ave' is the most common End station

Streeter Dr & Grand Ave    7512
Name: End Station, dtype: int64

**most common trip from start to end??**

In [44]:
Chicago_data['Start Station'].value_counts().head(1)

Streeter Dr & Grand Ave    6911
Name: Start Station, dtype: int64

In [47]:
Chicago_data['End Station'].value_counts().head(1)
#'Streeter Dr & Grand Ave' is the most common trip from start to end

Streeter Dr & Grand Ave    7512
Name: End Station, dtype: int64

**total travel time??**

In [51]:
Chicago_data['Trip Duration'].sum()
#total travel time = 280871787 sec = 4681196.45 min = 78019.9 h

280871787

**average travel time??**

In [53]:
Chicago_data['Trip Duration'].mean()
#average travel time = 936.23929 sec = 15.6 min = 0.2 h

936.23929

**counting of each user type**

In [56]:
Chicago_data['User Type'].value_counts()
#Subscriber = 238889
#Customer =  61110
#Dependent  = 1

Subscriber    238889
Customer       61110
Dependent          1
Name: User Type, dtype: int64

**counting of each gender**

In [59]:
Chicago_data['Gender'].value_counts()
#Male = 181190
#Female = 57758

Male      181190
Female     57758
Name: Gender, dtype: int64

**'earliest' most common year of birth**

In [75]:
Chicago_data.sort_values(by='Birth Year').head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year,Start time o'clock,End time o'clock,Starting H,Ending H
117906,658362,2017-04-25 10:56:40,2017-04-25 11:05:35,535,Prairie Ave & Garfield Blvd,University Ave & 57th St,Subscriber,Male,1899.0,1900-01-01 10:56:40,1900-01-01 11:05:35,10,11

In [77]:
Chicago_data['Birth Year'].value_counts().head(1)
#the most common year of birth is 1989

1989.0    14666
Name: Birth Year, dtype: int64

In [78]:
Chicago_data['Birth Year'].min()
#earliest year of birth is = 1899

1899.0

In [80]:
Chicago_data['Birth Year'].max()
#most recent year of birth is = 2016

2016.0

# ..........................................................................

# Second we are going to answer the question due to new_york_city

In [2]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta
import time

**loading of ny_data**

In [3]:
ny_data = pd.read_csv('new_york_city.csv')

**exploration of componants of data**

In [4]:
ny_data.columns

Index(['Unnamed: 0', 'Start Time', 'End Time', 'Trip Duration',
       'Start Station', 'End Station', 'User Type', 'Gender', 'Birth Year'],
      dtype='object')

In [5]:
ny_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     300000 non-null  int64
 1   Start Time     300000 non-null  object
 2   End Time       300000 non-null  object
 3   Trip Duration  300000 non-null  int64
 4   Start Station  300000 non-null  object
 5   End Station    300000 non-null  object
 6   User Type      299308 non-null  object
 7   Gender         270791 non-null  object
 8   Birth Year     271780 non-null  float64
dtypes: float64(1), int64(2), object(6)
memory usage: 20.6+ MB

In [6]:
ny_data.head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year
0,5688089,2017-06-11 14:55:05,2017-06-11 15:08:21,795,Suffolk St & Stanton St,W Broadway & Spring St,Subscriber,Male,1998.0

**converting [Start Time,End Time] from object to datetime**

In [7]:
ny_data['Start Time'] = pd.to_datetime(ny_data['Start Time'], format='%Y-%m-%d %H:%M:%S')

In [8]:
ny_data['End Time'] = pd.to_datetime(ny_data['End Time'], format='%Y-%m-%d %H:%M:%S')

**Checking data info**

In [9]:
ny_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     300000 non-null  int64
 1   Start Time     300000 non-null  datetime64[ns]
 2   End Time       300000 non-null  datetime64[ns]
 3   Trip Duration  300000 non-null  int64
 4   Start Station  300000 non-null  object
 5   End Station    300000 non-null  object
 6   User Type      299308 non-null  object
 7   Gender         270791 non-null  object
 8   Birth Year     271780 non-null  float64
dtypes: datetime64[ns](2), float64(1), int64(2), object(4)
memory usage: 20.6+ MB

**spliting datetime**

In [10]:
ny_data["Start time o'clock"] = ny_data['Start Time'].dt.time

In [11]:
ny_data.head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year,Start time o'clock
0,5688089,2017-06-11 14:55:05,2017-06-11 15:08:21,795,Suffolk St & Stanton St,W Broadway & Spring St,Subscriber,Male,1998.0,14:55:05

**convering[Start time o'clock,End time o'clock] to datetime**

In [12]:
ny_data["Start time o'clock"] = pd.to_datetime(ny_data["Start time o'clock"], format='%H:%M:%S')

In [13]:
ny_data.head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year,Start time o'clock
0,5688089,2017-06-11 14:55:05,2017-06-11 15:08:21,795,Suffolk St & Stanton St,W Broadway & Spring St,Subscriber,Male,1998.0,1900-01-01 14:55:05

**splitting datetime to 'Hour' column**

In [14]:
ny_data['Starting H'] = ny_data["Start time o'clock"].dt.strftime('%H')

In [15]:
ny_data.head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year,Start time o'clock,Starting H
0,5688089,2017-06-11 14:55:05,2017-06-11 15:08:21,795,Suffolk St & Stanton St,W Broadway & Spring St,Subscriber,Male,1998.0,1900-01-01 14:55:05,14

**Finding the most common Hour**

In [16]:
ny_data['Starting H'].value_counts().head(1)
#The most common Hour equel 17

17    30041
Name: Starting H, dtype: int64

**Splitting date to 'Month'**
**and finding the most common month**

In [17]:
ny_data['Start Time'].dt.month.value_counts().head(1)
#the most common  month in Start time is 6 'June'

6    76022
Name: Start Time, dtype: int64

**Splitting date to 'Day'**
**and finding the most common Day**

In [18]:
ny_data['Start Time'].dt.day.value_counts().head(1)
#the most common  day in Start time is 28

28    11503
Name: Start Time, dtype: int64

**most common start station??**

In [19]:
ny_data['Start Station'].value_counts().head(1)
#'Pershing Square North' is the most common start station

Pershing Square North    3069
Name: Start Station, dtype: int64

**most common end station??**

In [20]:
ny_data['End Station'].value_counts().head(1)
#'Pershing Square North' is the most common End station

Pershing Square North    3077
Name: End Station, dtype: int64

**most common trip from start to end??**

In [21]:
ny_data['Start Station'].value_counts().head(1)

Pershing Square North    3069
Name: Start Station, dtype: int64

**total travel time??**

In [22]:
ny_data['Trip Duration'].sum()
#total travel time = 269905248 sec = 4498420.8 min = 74973.68 h

269905248

**average travel time??**

In [23]:
ny_data['Trip Duration'].mean()
#average travel time = 899.68416 sec = 14.99 min = 0.25 h

899.68416

**counting of each user type**

In [24]:
ny_data['User Type'].value_counts()
#Subscriber    269149
#Customer       30159

Subscriber    269149
Customer       30159
Name: User Type, dtype: int64

**counting of each gender**

In [30]:
ny_data['Gender'].value_counts()
#Male      204008
#Female     66783

Male      204008
Female     66783
Name: Gender, dtype: int64

**'earliest' most common year of birth**

In [31]:
ny_data.sort_values(by='Birth Year').head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year,Start time o'clock,Starting H
121248,3433199,2017-04-28 16:14:05,2017-04-28 16:18:21,256,MacDougal St & Prince St,Mercer St & Bleecker St,Subscriber,NaN,1885.0,1900-01-01 16:14:05,16

In [32]:
ny_data['Birth Year'].value_counts().head(1)
#the most common year of birth is 1989

1989.0    11126
Name: Birth Year, dtype: int64

In [33]:
ny_data['Birth Year'].min()
#earliest year of birth is = 1885

1885.0

In [34]:
ny_data['Birth Year'].max()
#most recent year of birth is =2001

2001.0

# ...................................

# Third we are going to answer the question due to new_york_city

In [1]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta
import time

**loading of Chicago data**

In [3]:
wash_data = pd.read_csv('washington.csv')

**exploration of componants of data**

In [4]:
wash_data.columns

Index(['Unnamed: 0', 'Start Time', 'End Time', 'Trip Duration',
       'Start Station', 'End Station', 'User Type'],
      dtype='object')

In [5]:
wash_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 7 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     300000 non-null  int64
 1   Start Time     300000 non-null  object
 2   End Time       300000 non-null  object
 3   Trip Duration  300000 non-null  float64
 4   Start Station  300000 non-null  object
 5   End Station    300000 non-null  object
 6   User Type      300000 non-null  object
dtypes: float64(1), int64(1), object(5)
memory usage: 16.0+ MB

In [6]:
wash_data.head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type
0,1621326,2017-06-21 08:36:34,2017-06-21 08:44:43,489.066,14th & Belmont St NW,15th & K St NW,Subscriber

**converting [Start Time,End Time] from object to datetime**

In [7]:
wash_data['Start Time'] = pd.to_datetime(wash_data['Start Time'], format='%Y-%m-%d %H:%M:%S')

**Checking data info**

In [9]:
wash_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 7 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     300000 non-null  int64
 1   Start Time     300000 non-null  datetime64[ns]
 2   End Time       300000 non-null  object
 3   Trip Duration  300000 non-null  float64
 4   Start Station  300000 non-null  object
 5   End Station    300000 non-null  object
 6   User Type      300000 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 16.0+ MB

**spliting datetime**

In [10]:
wash_data["Start time o'clock"] = wash_data['Start Time'].dt.time

In [11]:
wash_data.head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Start time o'clock
0,1621326,2017-06-21 08:36:34,2017-06-21 08:44:43,489.066,14th & Belmont St NW,15th & K St NW,Subscriber,08:36:34

**convering[Start time o'clock,End time o'clock] to datetime**

In [12]:
wash_data["Start time o'clock"] = pd.to_datetime(wash_data["Start time o'clock"], format='%H:%M:%S')

In [14]:
wash_data.head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Start time o'clock
0,1621326,2017-06-21 08:36:34,2017-06-21 08:44:43,489.066,14th & Belmont St NW,15th & K St NW,Subscriber,1900-01-01 08:36:34

**splitting datetime to 'Hour' column**

In [15]:
wash_data['Starting H'] = wash_data["Start time o'clock"].dt.strftime('%H')

In [16]:
wash_data.head(1)

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Start time o'clock,Starting H
0,1621326,2017-06-21 08:36:34,2017-06-21 08:44:43,489.066,14th & Belmont St NW,15th & K St NW,Subscriber,1900-01-01 08:36:34,08

**Finding the most common Hour**

In [18]:
wash_data['Starting H'].value_counts().head(1)
#The most common Hour equel 08

08    33019
Name: Starting H, dtype: int64

**Splitting date to 'Month'**
**and finding the most common month**

In [19]:
wash_data['Start Time'].dt.month.value_counts().head(1)
#the most common  month in Start time is 6 'June'

6    68339
Name: Start Time, dtype: int64

**Splitting date to 'Day'**
**and finding the most common Day**

In [22]:
wash_data['Start Time'].dt.day.value_counts().head(1)
#the most common  day in Start time is 21

21    11432
Name: Start Time, dtype: int64

**most common start station??**

In [24]:
wash_data['Start Station'].value_counts().head(1)
#'Columbus Circle / Union Station' is the most common start station

Columbus Circle / Union Station    5656
Name: Start Station, dtype: int64

**most common end station??**

In [26]:
wash_data['End Station'].value_counts().head(1)
#'Columbus Circle / Union Station' is the most common End station

Columbus Circle / Union Station    6048
Name: End Station, dtype: int64

**most common trip from start to end??**

In [28]:
wash_data['Start Station'].value_counts().head(1)

Columbus Circle / Union Station    5656
Name: Start Station, dtype: int64

In [30]:
wash_data['End Station'].value_counts().head(1)
#'Columbus Circle / Union Station' is the most common trip from start to end

Columbus Circle / Union Station    6048
Name: End Station, dtype: int64

**total travel time??**

In [31]:
wash_data['Trip Duration'].sum()
#total travel time = 371183985.484 sec = 6186399.7 min = 103106.66 h

371183985.484

**average travel time??**

In [33]:
wash_data['Trip Duration'].mean()
#average travel time = 1237.2799516133446 sec = 20.87 min = 0.34 h

1237.2799516133446

**counting of each user type**

In [35]:
wash_data['User Type'].value_counts()
#Subscriber    220786
#Customer       79214

Subscriber    220786
Customer       79214
Name: User Type, dtype: int64

# End of project !